Autodesk.Revit.DB.ExternalResourceBrowserData.CallingDocumentHasModelPath
Indicates whether the document requesting the external resource browser data has a defined ModelPath.
Remarks:
A project that is detached, or has not been saved to disk yet, will not have a ModelPath.
Returns:
True if the document has a defined ModelPath.
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.GetCallingDocumentModelPath
Returns a copy of the ModelPath of the document that is requesting the external resource browser data.
Returns:
A copy of the ModelPath of the document that is requesting the external resource browser data.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document requesting the external resource browser data does not have a ModelPath, either because
it is detached, or because it has not been saved to disk yet, or no document specified.
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.IsValidFolderName(System.String)
Checks whether the folder name is valid.
folderName:
The folder name to check.
Returns:
True if the name is a valid folder name, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.IsValidResourceName(System.String)
Checks whether the resource name is valid.
resourceName:
The resource name to check.
Returns:
True if the name is a valid resource name, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.ExternalResourceBrowserData.GetSubFoldersData
Gets the subfolders data under the folder path of the browser data.
Returns:
The subfolders data under folder path of the browser data.
Since:
2019.1

Autodesk.Revit.DB.ExternalResourceBrowserData.GetSubFolders
Gets the subfolders under the folder path of the browser data.
Returns:
The subfolders under folder path of the browser data.
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.GetResources
Gets the external resources under the folder path of the browser data.
Returns:
The external resources under current folder of the browser data.
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.GetMatchOptions
Gets the match options used to filter external resources.
Returns:
The external resource match options.
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.AddSubFolder(System.String,System.String)
Adds a subfolder to the folder path with the given name and icon type.
folderName:
The name of the folder.
iconPath:
Icon path.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The folderName is not a valid folder name used to display in Revit external resource browse UI.
The name should be a unique non-empty short name and it should not contain any invalid character of \\/:*?"<>|.
The length of combined path(server name + folder path) should not exceeds 259.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019.1

Autodesk.Revit.DB.ExternalResourceBrowserData.AddSubFolder(System.String)
Adds a subfolder to the folder path with the given name.
folderName:
The name of the folder.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The folderName is not a valid folder name used to display in Revit external resource browse UI.
The name should be a unique non-empty short name and it should not contain any invalid character of \\/:*?"<>|.
The length of combined path(server name + folder path) should not exceeds 259.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.AddResource(System.String,System.String,System.Collections.Generic.IDictionary{System.String,System.String})
Adds an external resource to the folder path by supplying the resource name, version and reference information.
resourceName:
The unique short name of external resource.
version:
The version of external resource.
referenceInformation:
The (String, String) map containing reference or lookup information that will
be stored in Revit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The resourceName is not a valid resource name used to display in Revit external resource browse UI.
The name should be a unique non-empty short name and it should not contain any invalid character of \\/:*?"<>|.
The length of combined path(server name + folder path + resourceName) should not exceeds 259.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.AddResource(System.String,System.String)
Adds an external resource to the folder path by supplying the resource name and version.
resourceName:
The unique short name of external resource.
version:
The version of external resource.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The resourceName is not a valid resource name used to display in Revit external resource browse UI.
The name should be a unique non-empty short name and it should not contain any invalid character of \\/:*?"<>|.
The length of combined path(server name + folder path + resourceName) should not exceeds 259.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.AddResource(System.String,System.Collections.Generic.IDictionary{System.String,System.String})
Adds an external resource to the folder path by supplying the resource name and reference information.
resourceName:
The unique short name of external resource.
referenceInformation:
The (String, String) map containing reference or lookup information that will
be stored in Revit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The resourceName is not a valid resource name used to display in Revit external resource browse UI.
The name should be a unique non-empty short name and it should not contain any invalid character of \\/:*?"<>|.
The length of combined path(server name + folder path + resourceName) should not exceeds 259.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.AddResource(System.String)
Adds an external resource to the folder path by supplying the resource name.
resourceName:
The unique short name of external resource.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The resourceName is not a valid resource name used to display in Revit external resource browse UI.
The name should be a unique non-empty short name and it should not contain any invalid character of \\/:*?"<>|.
The length of combined path(server name + folder path + resourceName) should not exceeds 259.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalResourceBrowserData.FolderPath
The current folder path to which the new resources and subfolder belong.
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.ServerId
The Id of IExternalResourceServer which handles the external resource load.
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.#ctor(Autodesk.Revit.DB.Document,System.Guid,System.String,Autodesk.Revit.DB.ExternalResourceMatchOptions)
Constructs a new ExternalResourceBrowserData using the given document(optional), server id, folder path and match options.
document:
The document for which the external resource browser data is requested.
The document can be null, if so, the getCallingDocumentModelPath() will not return ModelPath.
serverId:
The id of IExternalResourceServer which handles the external resource browsing and loading.
folderPath:
The folder path to which the external resources and subfolders belong.
The folder separator should always be "/" and "/" always represents the root folder for the server.The interpretation of what a folder represents is up to the server.
For example, the folder "/English/Keynote" might be a physical folder on a disk, or a table or key in a database.
matchOptions:
The options to match the external resources and folders.
Generally, the returned resources should match the options, otherwise the resource may be regarded
as invalid which may not be available in browser dialogs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData
Represents a collection of external resources and external resource folders to be presented as
the content of a folder in the file browser in Revit.
Remarks:
This data represents the contents to be shown to the user while they are browsing a specific folder in Revit.
The folder path can be obtained from the Autodesk.Revit.DB.ExternalResourceBrowserData.FolderPath property.
The external resource server is expected to populate all of the available resources and subfolders
that should appear in the Revit file browser while the browser is open to this particular folder.
If the user navigates to another folder, a different ExternalResourceBrowserData object will be
provided to allow the server to populate resources at that location.
When adding resource and subfolder, the resource and subfolder should not be added recursively.
When adding resource and subfolder, the name should be unique short name(without folder).
The name of resource and subfolder should not contain any invalid character of \/:*?"<>|.
The length of resource combined path(server name + folder path + resource name) should not exceed 259;
The length of subfolder also has same restriction.
Since:
2015